// miniprogram/pages/help/help.js
Page({

	/**
	 * 页面的初始数据
	 */
	data: {
		tips: [
			{title: "开始游戏", content: "按下屏幕或移动手指，会根据右上角彩色多环按钮上的颜色生成沙子，从触碰点坠落", },
			{title: "更换颜色", content: "点击屏幕右上角彩色多环按钮，进入选择颜色界面，点击黑白多环按钮，生成新的多彩颜色，点击屏幕上其他位置，使用纯色", },
			{title: "我的颜色", content: "长按更换颜色按钮，可在弹出的窗口中添加、删除和选择使用 我的颜色"},
			{title: "自动坠落沙子", content: "双击屏幕会根据移动轨迹自动落沙，可自行设置沙子移动轨迹"},
			{title: "保存到本地/发送给好友", content: "在 我的作品 页面，点击作品预览，长按预览图保存到本地/发送给好友"},
			{title: "上传", content: "在 我的作品 页面，点击作品右下角上传按钮，上传到服务器。上传前必须在菜单页点击头像来获取个人头像"},
			{title: "分享给好友", content: "上传作品后，右下角有分享按钮，点击分享给好友"},
		]
	},

	/**
	 * 生命周期函数--监听页面加载
	 */
	onLoad: function (options) {

	},

	/**
	 * 生命周期函数--监听页面初次渲染完成
	 */
	onReady: function () {

	},

	/**
	 * 生命周期函数--监听页面显示
	 */
	onShow: function () {

	},

	/**
	 * 生命周期函数--监听页面隐藏
	 */
	onHide: function () {

	},

	/**
	 * 生命周期函数--监听页面卸载
	 */
	onUnload: function () {

	},

	/**
	 * 页面相关事件处理函数--监听用户下拉动作
	 */
	onPullDownRefresh: function () {

	},

	/**
	 * 页面上拉触底事件的处理函数
	 */
	onReachBottom: function () {

	},
})